package drill02;

public class ex01 {

	public static void main(String[] args) {
		
		/**
		 * 문제 1. 올바른 식별자 고르기
		 * 
		 * 다음 중 자바 식별자로 사용 가능한 이름을 모두 고르세요.
		 * 
		 * 1) int  2) first_name  3) 9items  4) $total  5) className  6) public
		 * 
		 */
		
		/**
		 * 1) 정수형을 나타내는 자바의 예약어라 식별자로 사용 못함.
		 *
		 * 2) 문자와 _로 이루어져 있으며 식별자로 사용 가능.
		 * 
		 * 3) 숫자 9로 이루어져 있으며 숫자는 식별자로 사용 못함.
		 * 
		 * 4) $,_는 식별자 첫 글자로 사용 가능.
		 * 
		 * 5) 문제 없음, 영어로만 구성되어 있어서 식별자로 사용 가능.
		 * 
		 * 6) 접근 제어자인 자바의 예약어라 식별자로 사용 못함.
		 * 
		 * 2 / 4 / 5
		 * 
		 */
		
	}

}
